[
    {
        "id": 1,
        "name": "Missionary position",
        "description": "Missionary sex can be hot because of the intensity it can bring on—the skin-to-skin contact, eye contact, the close-up smells of each other’s bodies, and just the mere closeness of two bodies",
        "imageLink": "https://sexpositions.club/wp-content/uploads/2016/03/3_8.png"
    },
    {
        "id": 2,
        "name": "Doggystyle",
        "description": "Doggy style is a sex position in which a person bends over, crouches on all fours (usually on hands and knees), or lies on their abdomen, for sexual intercourse, other forms of sexual penetration or other sexual activity.",
        "imageLink": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d6/Wiki-dstyle.png/440px-Wiki-dstyle.png"
    },
    {
        "id": 3,
        "name": "Cowgirl",
        "description": "In the cowgirl position, you get to view your partner's face, the way his body moves and the pleasure felt while you move and work on your pleasure.",
        "imageLink": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/11-the-see-saw-jpg-1619030083.jpg"
    },
    {
        "id": 4,
        "name": "Legs on shoulders",
        "description": "It is adventurous spin on missionary—with you lying back and placing your legs over your partner’s shoulders. “The man’s penis is drawn to the woman’s vagina by gravity.",
        "imageLink": "https://www.menshealth.com.au/wp-content/uploads/2021/05/legs-on-shoulder-sex-position.jpg"
    },
    {
        "id": 5,
        "name": "Amazon",
        "description": "sort of like reverse missionary, has the vulva-owner on top—they're totally dominant, just like an Amazon. The person with a penis lies on their back, and for the most part, is straight up chilling, letting the top take control.",
        "imageLink": "https://hips.hearstapps.com/hmg-prod/images/menshealth-amazon-1595873110.jpg?resize=768:*"
    },
    {
        "id": 6,
        "name": "Interrogation Chair ",
        "description": " This position is great for oral,using toys, or good for oral. ",
        "imageLink": "https://images.app.goo.gl/uv7gF6b8duyAC8Rd7"
    },
    {
        "id": 7,
        "name": "Face-Off",
        "description": "Your partner sits on a chair or the edge of the bed; you face them, seated on their lap.",
        "imageLink": "https://hips.hearstapps.com/hmg-prod/images/wmh07012019-sex-positions-face-off-1562099039.png?crop=1xw:1xh;center,top&resize=980:*"
    },
    {
        "id": 8,
        "name": "Pin It!",
        "description": "Pin now, try them out later!",
        "imageLink": "https://www.sheknows.com/wp-content/uploads/2021/04/modified-coital-01.png?w=1280"
    },
     {
        "id": 9,
        "name": "The wheelbarrow",
        "description": "If you have the stamina to try the wheelbarrow, which involves getting down on all fours as your partner holds your legs up and enters you from behind, go for it. This is definitely an athletic position that, similar to doggy style, will give you excellent depth of penetration and access of semen to the cervix",
        "imageLink": "https://hips.hearstapps.com/womenshealth-production.s3.amazonaws.com/images/1753/the-wheelbarrow-best-sex-positions-ever__medium_4x3.jpg?resize=480:*"
    },
    {
        "id": 10,
        "name": "Corkscrew",
        "description": "Near the edge of a bed or bench, rest on your hip and forearm and press your thighs together. Your partner stands and straddles you, entering or grinding from behind.",
        "imageLink": "https://hips.hearstapps.com/hmg-prod/images/wmh07012019-sex-positions-corkscrew-1562099198.png?crop=0.956xw:0.910xh;0.0187xw,0.0521xh&resize=980:*"
    },{
        "id": 11,
        "name": " Pretzel Dip",
        "description": "Lie on your right side; your partner kneels, straddling your right leg and curling your left leg around their left side.",
        "imageLink": "https://hips.hearstapps.com/hmg-prod/images/wmh07012019-sex-positions-prezel-dip-1562098803.png?crop=0.833xw:0.781xh;0.0835xw,0.125xh&resize=980:*"
    },
    
    {
        "id": 12,
        "name": " Flatiron",
        "description": "Lie facedown on the bed, legs straight, hips slightly raised.",
        "imageLink": "https://hips.hearstapps.com/hmg-prod/images/wmh07012019-sex-positions-flatiron-1562098910.png?crop=1.00xw:0.668xh;0,0.150xh&resize=980:*"
    },
    {
        "id": 13,
        "name": " G-Whiz",
        "description": "Lie back with your legs resting on each of your partner’s shoulders.",
        "imageLink": "https://hips.hearstapps.com/hmg-prod/images/wmh07012019-sex-positions-g-whiz-1633534876.png?resize=980:*"
    }, {
        "id": 14,
        "name": "Leap Frog ",
        "description": "This is a modified doggy-style. Get on your hands and knees, then, keeping hips raised, rest your head and arms on the bed.",
        "imageLink": "https://hips.hearstapps.com/hmg-prod/images/wmh07012019-sex-positions-leap-frog-1562099088.png?crop=0.973xw:0.739xh;0,0.121xh&resize=980:*"
    }, 
      {
        "id": 15,
        "name": "Magic Mountain ",
        "description": "Your partner sits, legs bent, leaning back on their hands and forearms. You do the same and then inch toward them until you make contact.",
        "imageLink": ""
    },
      {
        "id": 16,
        "name": "Spooning",
        "description": "Both partners lie on their sides, your front pressing against her back like the spooning cuddle position.You're the big spoon, she the little spoon.Your partner should separate her legs a little. Find her vagina with your hand, and enter her from behind..",
        "imageLink": "https://cdn.shopify.com/s/files/1/0289/9994/2243/files/Spooning-sex-position_1024x1024.png?v=1580167114"
    },
    {
        "id": 17,
        "name": "Magic Mountain",
        "description": "Your partner sits, legs bent, leaning back on their hands and forearms. You do the same and then inch toward them until you make contact.",
        "imageLink": "https://imgs.search.brave.com/ft0eoXM6b9LjtVci_a_mDsqdiAbhPyY_bcb27ZXbjBg/rs:fit:532:225:1/g:ce/aHR0cHM6Ly90c2Ux/LmV4cGxpY2l0LmJp/bmcubmV0L3RoP2lk/PU9JUC5xYi12QUd5/cTQ1M3hKRHoxY2Z4/Um93QUFBQSZwaWQ9/QXBp"
    },
     {
        "id": 18,
        "name": "Cowboy",
        "description": "You lie on your back while your partner straddles you. They then gently inserts their penis, strap-on, or finger through the tight opening created by your semi-closed legs.",
        "imageLink": "https://hips.hearstapps.com/hmg-prod/images/wmh07012019-sex-positions-cowboy-1562099471.png?crop=0.962xw:0.718xh;0.0146xw,0.138xh&resize=768:*" 
        },
         {
        "id": 19,
        "name": "Ballet Dancer",
        "description": "Standing on one foot, face your partner and wrap your other leg around their waist while they help support you.",
        "imageLink": "https://hips.hearstapps.com/hmg-prod/images/wmh07012019-sex-positions-ballet-dancer-1562099146.png?resize=768:*"
    },
       {
        "id": 20,
        "name": "Cross-Booty",
        "description": "Your partner enters you from the missionary position, then slides their chest and legs off your body so their pelvis is in the same location but their limbs form an “X” with yours.",
        "imageLink": "https://hips.hearstapps.com/hmg-prod/images/wmh07012019-sex-positions-cross-booty-1562099293.png?crop=0.891xw:0.958xh;0,0&resize=768:*"
    },
     {
        "id": 21,
        "name": "The Socket ",
        "description": "From reverse cowgirl, have them bend all the way forward, extending their legs all the way back. They should be supporting their body by resting on their elbows, as if they were holding a plank.",
        "imageLink": "https://hips.hearstapps.com/hmg-prod/images/men-shealth-thesocket-1581101518.jpg?resize=768:*"
    },
    {
        "id": 22,
        "name": " Happy Baby",
        "description": "The receiver assumes the happy baby pose, a popular yoga position where you lie on your back, bend your knees into your chest, grip the outer edges of your feet, and roll side to side like, well, a happy baby. In this case, instead of rolling around, the receiver stays put so the penetrating partner can enter them from a kneeling position.",
        "imageLink": "https://hips.hearstapps.com/hmg-prod/images/mh-happybaby-1650382591.jpg?resize=768:*"
    },
     {
        "id": 23,
        "name": " Standing O ",
        "description": "While on your knees have your partner stand up-right. They should then drape one of their legs around your shoulder while you eat them out.",
        "imageLink": "https://hips.hearstapps.com/hmg-prod/images/menshealth-standingo-1581101725.jpg?resize=640:*"
    },
       {
        "id": 24,
        "name": "The Little Dipper ",
        "description": "FYI, the partner on top will have sore triceps once you both finish. For the Little Dipper, the person on top uses either a bed, couch, or chair to hoist themselves over their partner. The person on bottom then inserts his penis into the top’s vagina or anus. The top then does tricep dips to move up and down on their partner’s penis. If done correctly, you should be in a T-shape formation.",
        "imageLink": "https://hips.hearstapps.com/hmg-prod/images/menshealth-littledipper-v2-1581101785.jpg?resize=768:*"
    },
      {
        "id": 25,
        "name": "The 69 Bridge ",
        "description": "This just looks impossible to me,” says Kerner. “But if you’re able to do it, go for it. I think it’s just a victory in being able to pull this position off.",
        "imageLink": "https://hips.hearstapps.com/hmg-prod/images/men-shealth-69-bridge-v2-1582129462.jpg?resize=768:*"
    },
        {
        "id": 26,
        "name": "Coital Alignment Technique ",
        "description": "The CAT is very similar to the missionary position except your body is positioned farther up and to one side. Instead of being chest to chest, your chest is near your partner's shoulders. Have them bend their legs about 45 degrees to tilt their hips up. This causes the base of your shaft to maintain constant contact with the clitoris",
        "imageLink": "https://hips.hearstapps.com/hmg-prod/images/men-shealth-thecat-1581101913.jpg?resize=768:*"
    },
     {
        "id": 27,
        "name": " The Captain",
        "description": "The receiver lies on their back and raises their legs in the air. Kneeling, the penetrating partner holds their ankles and spreads their legs into a V shape before entering them.",
        "imageLink": "https://hips.hearstapps.com/hmg-prod/images/mh-captain-1650390659.jpg?resize=768:*"
    },
      {
        "id": 28,
        "name": "Waterfall ",
        "description": "Move to the edge of the bed and lie back with your head and shoulders on the floor as your partner straddles you. The blood will rush to your head creating mind-blowing sensations upon orgasm.",
        "imageLink": "https://hips.hearstapps.com/hmg-prod/images/men-shealth-thewaterfall-1581101948.jpg?resize=768:*"
    },
     
    {
        "id": 29,
        "name": "One Up ",
        "description": "Kneel on the floor with your mate lying on the edge of the bed. Raise one of their legs and ask them to support it by wrapping their hands around their hamstring just below the knee. With one hip raised, your partner will be able to add some movement to aid in your stroking or to help move you to the perfect spot.",
        "imageLink": "https://hips.hearstapps.com/hmg-prod/images/men-shealth-oneup-v2-1581101983.jpg?resize=768:*"
    },
     {
        "id": 30,
        "name": "The Hot Seat ",
        "description": "Sit on the edge of the bed or on a chair with your feet on the floor. Your mate turns away and backs up onto you, sitting between your legs. They can ride back and forth by pushing off the chair arms or pressing up with their feet. They can control the angle of entry by arching their back and pressing their buttocks into your groin. While doggy style is about your dominance, The Hot Seat puts your partner in the driver's seat. And that makes it one of the best sex positions for both of you.",
        "imageLink": "https://hips.hearstapps.com/hmg-prod/images/men-shealth-hotseat-1581102043.jpg?resize=640:*"
    },
    {
        "id": 31,
        "name": " Spin Cycle",
        "description": "This is a variation on the Hot Seat with your partner sitting in your lap, but this time planting yourselves on top of a washing machine set at the highest agitator cycle.",
        "imageLink": "https://hips.hearstapps.com/hmg-prod/images/menshealth-spincycle-1581102077.jpg?resize=640:*"
    },
      {
        "id": 32,
        "name": "Stairway to Heaven ",
        "description": "This is a variation on the Hot Seat with your partner sitting on top of you while you sit on one of the stairs of a staircase. Stairs offer good seating possibilities, and a hand rail for extra support and lifting leverage for them.",
        "imageLink": "https://hips.hearstapps.com/hmg-prod/images/menshealth-stairwaytoheaven-1581102102.jpg?resize=768:*"
    },
      {
        "id": 33,
        "name": "Pole Position ",
        "description": "Lie on your back and bend one of your legs, keeping the other outstretched. Your partner straddles the raised leg with a thigh on either side and lowers themselves onto your member so that their back is facing you. They should hold your knee and use it for support as they rock up and down.",
        "imageLink": "https://hips.hearstapps.com/hmg-prod/images/menshealth-poleposition-1581102164.jpg?resize=768:*"
    },
     {
        "id": 34,
        "name": " The Lazy Man ",
        "description": "Place pillows behind your back and sit on the bed with legs outstretched. Your partner straddles your waist, feet on the bed. They then bends their knees to lower themselves onto you, using one hand to direct your penis in. Just by pressing on the balls of their feet and releasing, they can raise and lower themselves on your shaft as slowly or quickly as they please.",
        "imageLink": "https://hips.hearstapps.com/hmg-prod/images/menshealth-lazyman-1581102217.jpg?resize=768:*"
    },
     {
        "id": 35,
        "name": " David Copperfield",
        "description": "Place a pillow under their hips to tilt their pelvis up. Bend their knees so they can place their feet on your shoulder blades.",
        "imageLink": "https://hips.hearstapps.com/hmg-prod/images/menshealth-davidscopperfield-1581102244.jpg?resize=768:*"
    },
    
    {
        "id": 36,
        "name": "Heir to the Thron ",
        "description": "Have your partner sit on a chair with their legs wide open. You take it from there. This is a good sex position for either beginning the slow build-up with loose, broad, strokes, or ending with strong suction. Your partner is able to easily guide you, and they're able to get a full view of you between her legs, which is a turn-on for many people.",
        "imageLink": "https://hips.hearstapps.com/hmg-prod/images/menshealth-heirtothethrone-1581102275.jpg?resize=640:*"
    },
    {
        "id": 37,
        "name": "Closed for Business ",
        "description": "Some people with vulvas find direct clitoral stimulation uncomfortable. Having your mate close their legs during oral sex may help. Place your hand above their public mound applying light pressure, then rub your firm tongue on the area around the clitoris to add indirect stimulation.",
        "imageLink": "https://hips.hearstapps.com/hmg-prod/images/menshealth-closedbusiness-1581102307.jpg?resize=768:*"
    },
     {
        "id": 38,
        "name": "Yourself on the Shelf ",
        "description": "Have your partner perch their butt right on the edge of the bed. With you standing in front, you can enter them. Then have them wrap their legs around you. From there, stand up-right, placing your hands around their back to support your partner.",
        "imageLink": "https://hips.hearstapps.com/hmg-prod/images/menshealth-yourselfonashelf-1581101522.jpg?resize=640:*"
    },
      {
        "id": 39,
        "name": " Butter Churner",
        "description": " Have your partner lie on their back with their legs raised over their head. This is not a plain Jane position! Squat over them and dip your penis in and out of them. Be extra careful to thrust lightly to avoid stressing their neck—Kerner warns this position could potentially result in a neck injury.",
        "imageLink": "https://hips.hearstapps.com/hmg-prod/images/menshealth-butterchurner-1581102466.jpg?resize=640:*"
    },
    {
        "id": 40,
        "name": "Iron Chef ",
        "description": "A variation of The Ballet Dancer in which your partner raises their legs up and wraps them around your butt or thighs. Your kitchen counter is the perfect height for this standing-to-seated appetizer.",
        "imageLink": "https://hips.hearstapps.com/hmg-prod/images/menshealth-ironchef-v2-1581102562.jpg?resize=640:*"
    },
      
    {
        "id": 50,
        "name": "Gift Wrapped ",
        "description": "Both of you lie on your sides facing one another. Your partner bends and spreads their legs, and angles their vagina toward you. You lift your legs between theirs to enter while they wrap their legs around your back.",
        "imageLink": "https://hips.hearstapps.com/hmg-prod/images/menshealth-giftwrapped-1581103304.jpg?resize=768:*"
    },
     {
        "id": 51,
        "name": " The X Position",
        "description": "Sit on the bed facing each other with legs forward. Lift your right leg over their left and they lift their right leg over your left. Come together so you can enter. Now both of you lie back, with your legs forming an X. Slow, leisurely gyrations replace thrusting.",
        "imageLink": "https://hips.hearstapps.com/hmg-prod/images/menshealth-thexposition-1581103466.jpg?resize=768:*"
    },
     {
        "id": 52,
        "name": "Snow Angel ",
        "description": "This is challenging: Your partner lies on their back while you straddle them facing away. They lift their legs and wrap them around your back to elevate their pelvis so you can enter. They then grab your butt to help you slide up and back. They can add a little massage action to their grip also.",
        "imageLink": "https://hips.hearstapps.com/hmg-prod/images/menshealth-thesnowangel-1581103492.jpg?resize=768:*"
    },
     {
        "id": 53,
        "name": "The Spider ",
        "description": "Both of you are seated on the bed with legs toward one another, arms back to support yourselves. Now move together and they move onto you. Their hips will be between your spread legs, their knees bent and feet outside of your hips and flat on the bed. Now rock back and forth.",
        "imageLink": "https://hips.hearstapps.com/hmg-prod/images/menshealth-thespider-v2-1581103598.jpg?resize=768:*"
    },
    
    {
        "id": 54,
        "name": " Hovering Butterfly",
        "description": "Your partner straddles you placing their knees at your ears. They can hold onto a wall or headboard for support. While you're doing your thing, they can use their fingers to graze their nipples or rub the top of their vulva.",
        "imageLink": "https://hips.hearstapps.com/hmg-prod/images/menshealth-hoveringbutterfly-1581103629.jpg?resize=768:*"
    },
]
